[
    {
        "conceptID": "001",
        "prefLabel": "Net Promoter Score",
        "altLabels": ["NPS"],
        "definition": "A metric used to measure customer loyalty and satisfaction based on the likelihood of customers recommending the company's products or services to others.",
        "notes": "Typically scored on a 0-10 scale."
    },
    {
        "conceptID": "002",
        "prefLabel": "Lifetime Value",
        "altLabels": ["LTV", "Customer Lifetime Value"],
        "definition": "The total revenue a business can reasonably expect from a single customer account throughout the business relationship.",
        "notes": "Calculated by multiplying the average value of a sale, the number of transactions, and the retention time period."
    },
    {
        "conceptID": "003",
        "prefLabel": "Long-Term Relationship)",
        "altLabels": ["LTR", "Customer Retention", "Customer Relationship"],
        "definition": "The ongoing relationship between a company and its customers that aims to foster loyalty and repeated business.",
        "notes": "Often supported by customer service and loyalty programs."
    },
    {
        "conceptID": "004",
        "prefLabel": "Order",
        "altLabels": ["Sales Order"],
        "definition": "A formal request by a customer to purchase one or more products or services from a business.",
        "notes": "An order usually results in a legal obligation to fulfill the purchase."
    },
    {
        "conceptID": "005",
        "prefLabel": "Order Line Item",
        "altLabels": ["Line Item"],
        "definition": "A specific item within an order that details a particular product or service, including its price and quantity.",
        "notes": "Each line item represents a single billing entry in an order."
    },
    {
        "conceptID": "006",
        "prefLabel": "Product Category",
        "altLabels": ["Category"],
        "definition": "A classification that groups products according to common attributes or the market segments they are targeted to.",
        "notes": "Helps in organizing inventory and marketing efforts."
    },
    {
        "conceptID": "007",
        "prefLabel": "Stock Keeping Unit",
        "altLabels": ["SKU", "Inventory Item"],
        "definition": "A unique identifier for each distinct product and service that can be purchased.",
        "notes": "SKUs help in tracking inventory and facilitating accurate stock management."
    },
    {
        "conceptID": "008",
        "prefLabel": "Cart Abandonment Rate",
        "altLabels": ["Shopping Cart Abandonment", "Abandonment Rate"],
        "definition": "The rate at which customers add items to their shopping cart but then leave the website without completing the purchase.",
        "notes": "A key metric for analyzing e-commerce website performance."
    },
    {
        "conceptID": "009",
        "prefLabel": "Fulfillment",
        "altLabels": ["Order Fulfillment", "Shipping"],
        "definition": "The process of preparing and delivering a customer’s order.",
        "notes": "Can involve multiple stages including picking, packing, shipping, and delivery."
    },
    {
        "conceptID": "010",
        "prefLabel": "Return Rate",
        "altLabels": ["Product Returns", "Return Policy"],
        "definition": "The percentage of products sold that are returned by customers.",
        "notes": "A lower return rate can indicate higher customer satisfaction and product quality."
    }
]
